In [1]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

## Arrays

In [2]:
heights = make_array(67, 60, 71, 63, 65)
heights

array([67, 60, 71, 63, 65])

In [3]:
[67, 60, 71, 63, 65]

[67, 60, 71, 63, 65]

In [ ]:
heights / 12

In [4]:
len(heights)

5

In [8]:
a = sum(heights)

In [9]:
a / len(heights)

65.200000000000003

In [ ]:
np.average(heights)

In [11]:
heights * 2

array([134, 120, 142, 126, 130])

In [12]:
heights

array([67, 60, 71, 63, 65])

In [20]:
strings_array = make_array('ok', 'ya', 'hm')
strings_array

array(['ok', 'ya', 'hm'],
      dtype='<U2')

In [21]:
make_array('a','C') + make_array('b')

UFuncTypeError: ufunc 'add' did not contain a loop with signature matching types (dtype('<U1'), dtype('<U1')) -> None

In [16]:
strings_array + strings_array

UFuncTypeError: ufunc 'add' did not contain a loop with signature matching types (dtype('<U2'), dtype('<U2')) -> None

In [22]:
heights.item(3)

63

In [23]:
heights.item(0)

67

In [24]:
strings_array.item(0)

'ok'

In [33]:
np.arange(5,26,10)

array([ 5, 15, 25])

## Ranges ##

In [25]:
make_array(0, 1, 2, 3, 4, 5, 6)

array([0, 1, 2, 3, 4, 5, 6])

In [26]:
np.arange(6)

array([0, 1, 2, 3, 4, 5])

In [ ]:
np.arange(7)

In [27]:
np.arange(5, 11)

array([ 5,  6,  7,  8,  9, 10])

In [ ]:
np.arange(0, 20, 2)

In [ ]:
np.arange(0, 21, 2)

In [ ]:
np.arange(0, 1, 0.1)

In [ ]:
a = np.arange(8)

In [ ]:
a

In [ ]:
a.item(8)

## Creating a Table from Scratch ##

In [36]:
streets = make_array('Bancroft', 'Durant', 'Channing', 'Haste')
streets

array(['Bancroft', 'Durant', 'Channing', 'Haste'],
      dtype='<U8')

In [38]:
numbers = make_array(23,65,333,122)
numbers

array([ 23,  65, 333, 122])

In [34]:
Table()

In [37]:
southside = Table().with_column('Streets', streets)
southside

Streets
Bancroft
Durant
Channing
Haste

In [42]:
southside.with_column('Blocks from campus', np.arange(4)).labels

('Streets', 'Blocks from campus')

In [40]:
southside

Streets
Bancroft
Durant
Channing
Haste

In [ ]:
southside = southside.with_column('Blocks from campus', np.arange(4))
southside

In [41]:
southside.labels

('Streets',)

In [43]:
southside.num_columns

1

In [44]:
southside.num_rows

4

In [45]:
southside

Streets
Bancroft
Durant
Channing
Haste

In [51]:
courses = Table().with_columns("CS Courses", make_array('Java', 'Web'))
courses

CS Courses | Credits
Java       | 4
Web        | 2

In [47]:
courses.relabeled(0, "Courses")

Courses
Java
Web

In [49]:
courses.drop(0)

In [50]:
courses = courses.with_column("Credits", make_array(4,2))
courses

CS Courses | Credits
Java       | 4
Web        | 2

In [53]:
courses.with_column("Proportion", courses.column('Credits')/sum(courses.column(1)))

CS Courses | Credits | Proportion
Java       | 4       | 0.666667
Web        | 2       | 0.333333

In [57]:
courses = courses.with_column("Average", sum(courses.column(1))/courses.num_rows)

In [62]:
courses

CS Courses | Credits | Average
Java       | 4       | 3
Web        | 2       | 3

In [64]:
courses.where('Credits', are.not_below(sum(courses.column(1))/courses.num_rows))

CS Courses | Credits | Average
Java       | 4       | 3

In [69]:
courses.where(0, are.not_containing('Web'))

CS Courses | Credits | Average
Java       | 4       | 3

## Reading a Table from a File  ##

In [ ]:
du_bois = Table.read_table('du_bois.csv')
du_bois

In [ ]:
# Which group ("CLASS") spent the highest percentage on rent?
...

In [ ]:
du_bois.select('STATUS')

In [ ]:
du_bois.column('STATUS')

In [ ]:
du_bois.select('STATUS')

In [ ]:
du_bois.column('STATUS')

In [ ]:
du_bois.column('ACTUAL AVERAGE')

In [ ]:
du_bois.column('FOOD')

In [ ]:
du_bois.column('ACTUAL AVERAGE') * du_bois.column('FOOD')

In [ ]:
food_dollars = du_bois.column('ACTUAL AVERAGE') * du_bois.column('FOOD')
du_bois = du_bois.with_column(
    'Food $',
    food_dollars
)
du_bois

In [ ]:
du_bois.set_format('FOOD', PercentFormatter)

In [ ]:
du_bois.select('CLASS', 'ACTUAL AVERAGE', 'FOOD', 'Food $')

In [ ]:
du_bois.column('FOOD')

In [73]:
arr1 = make_array(2,4,6)
arr2 = make_array(2,4,3)

arr1 / arr2

array([ 1.,  1.,  2.])

In [70]:
movies = Table.read_table('movies_by_year_with_ticket_price.csv')
movies

Year | Average Ticket Price | Total Gross | Number of Movies | #1 Movie
2019 | 9.16                 | 11237.9     | 788              | Avengers: Endgame
2018 | 9.11                 | 11611.3     | 878              | Black Panther
2017 | 8.97                 | 11125.4     | 740              | Star Wars: Episode VIII - The Last Jedi
2016 | 8.65                 | 11373.7     | 737              | Rogue One: A Star Wars Story
2015 | 8.43                 | 11098.8     | 706              | Star Wars: Episode VII - The Force Awakens
2014 | 8.17                 | 10436.8     | 708              | American Sniper
2013 | 8.13                 | 10955.9     | 689              | The Hunger Games: Catching Fire
2012 | 7.96                 | 10959.6     | 669              | The Avengers
2011 | 7.93                 | 10114.1     | 601              | Harry Potter and the Deathly Hallows: Part 2
2010 | 7.89                 | 10212.7     | 538              | Toy Story 3
... (33 rows omitted)

In [74]:
movies_with_tickets_number = movies.with_column("Number of Tickets", movies.column(2) / movies.column(1))
movies_with_tickets_number

Year | Average Ticket Price | Total Gross | Number of Movies | #1 Movie                                     | Number of Tickets
2019 | 9.16                 | 11237.9     | 788              | Avengers: Endgame                            | 1226.84
2018 | 9.11                 | 11611.3     | 878              | Black Panther                                | 1274.57
2017 | 8.97                 | 11125.4     | 740              | Star Wars: Episode VIII - The Last Jedi      | 1240.29
2016 | 8.65                 | 11373.7     | 737              | Rogue One: A Star Wars Story                 | 1314.88
2015 | 8.43                 | 11098.8     | 706              | Star Wars: Episode VII - The Force Awakens   | 1316.58
2014 | 8.17                 | 10436.8     | 708              | American Sniper                              | 1277.45
2013 | 8.13                 | 10955.9     | 689              | The Hunger Games: Catching Fire              | 1347.59
2012 | 7.96                 | 10959.6     | 669              | The Avengers                                 | 1376.83
2011 | 7.93                 | 10114.1     | 601              | Harry Potter and the Deathly Hallows: Part 2 | 1275.42
2010 | 7.89                 | 10212.7     | 538              | Toy Story 3                                  | 1294.39
... (33 rows omitted)

In [82]:
 movies_with_tickets_number.where(3, are.below(450))

Year | Average Ticket Price | Total Gross | Number of Movies | #1 Movie                                  | Number of Tickets
2001 | 5.65                 | 8070        | 356              | Harry Potter and the Sorcerer's Stone     | 1428.32
2000 | 5.39                 | 7678.3      | 371              | How the Grinch Stole Christmas            | 1424.55
1999 | 5.06                 | 7316.7      | 385              | Star Wars: Episode I - The Phantom Menace | 1445.99
1998 | 4.69                 | 6575.8      | 336              | Saving Private Ryan                       | 1402.09
1997 | 4.59                 | 6671.8      | 303              | Titanic                                   | 1453.55
1996 | 4.42                 | 5706.7      | 310              | Independence Day                          | 1291.11
1995 | 4.35                 | 5383.5      | 279              | Toy Story                                 | 1237.59
1994 | 4.08                 | 5079.2      | 254              | Forrest Gump                              | 1244.9
1993 | 4.14                 | 4983.2      | 258              | Jurassic Park                             | 1203.67
1992 | 4.15                 | 4603.9      | 234              | Aladdin                                   | 1109.37
... (15 rows omitted)

In [87]:
table1 = movies_with_tickets_number.with_column('Remainder', movies_with_tickets_number.column(0) % 4)
table1.where('Remainder', 0)

Year | Average Ticket Price | Total Gross | Number of Movies | #1 Movie                                       | Number of Tickets | Remainder
2016 | 8.65                 | 11373.7     | 737              | Rogue One: A Star Wars Story                   | 1314.88           | 0
2012 | 7.96                 | 10959.6     | 669              | The Avengers                                   | 1376.83           | 0
2008 | 7.18                 | 9698.2      | 607              | The Dark Knight                                | 1350.72           | 0
2004 | 6.21                 | 9321.7      | 551              | Shrek 2                                        | 1501.08           | 0
2000 | 5.39                 | 7678.3      | 371              | How the Grinch Stole Christmas                 | 1424.55           | 0
1996 | 4.42                 | 5706.7      | 310              | Independence Day                               | 1291.11           | 0
1992 | 4.15                 | 4603.9      | 234              | Aladdin                                        | 1109.37           | 0
1988 | 4.11                 | 3565.8      | 248              | Rain Man                                       | 867.591           | 0
1984 | 3.36                 | 3347.7      | 165              | Beverly Hills Cop                              | 996.339           | 0
1980 | 2.69                 | 2299        | 115              | Star Wars: Episode V - The Empire Strikes Back | 854.647           | 0

In [113]:
census = Table.read_table('nc-est2014-agesex-res.csv')
census

SEX  | AGE  | CENSUS2010POP | ESTIMATESBASE2010 | POPESTIMATE2010 | POPESTIMATE2011 | POPESTIMATE2012 | POPESTIMATE2013 | POPESTIMATE2014
0    | 0    | 3944153       | 3944160           | 3951330         | 3963071         | 3926665         | 3945610         | 3948350
0    | 1    | 3978070       | 3978090           | 3957888         | 3966510         | 3978006         | 3943077         | 3962123
0    | 2    | 4096929       | 4096939           | 4090862         | 3971573         | 3979952         | 3992690         | 3957772
0    | 3    | 4119040       | 4119051           | 4111920         | 4102501         | 3983049         | 3992425         | 4005190
0    | 4    | 4063170       | 4063186           | 4077552         | 4122303         | 4112638         | 3994047         | 4003448
0    | 5    | 4056858       | 4056872           | 4064653         | 4087713         | 4132210         | 4123408         | 4004858
0    | 6    | 4066381       | 4066412           | 4073013         | 4074979         | 4097780         | 4143094         | 4134352
0    | 7    | 4030579       | 4030594           | 4043047         | 4083240         | 4084964         | 4108615         | 4154000
0    | 8    | 4046486       | 4046497           | 4025604         | 4053206         | 4093213         | 4095827         | 4119524
0    | 9    | 4148353       | 4148369           | 4125415         | 4035769         | 4063193         | 4104133         | 4106832
... (296 rows omitted)

In [89]:
census.where('AGE',999)

SEX  | AGE  | CENSUS2010POP | ESTIMATESBASE2010 | POPESTIMATE2010 | POPESTIMATE2011 | POPESTIMATE2012 | POPESTIMATE2013 | POPESTIMATE2014
0    | 999  | 308745538     | 308758105         | 309347057       | 311721632       | 314112078       | 316497531       | 318857056
1    | 999  | 151781326     | 151790132         | 152089484       | 153294635       | 154528573       | 155741368       | 156936487
2    | 999  | 156964212     | 156967973         | 157257573       | 158426997       | 159583505       | 160756163       | 161920569

In [92]:
census.where('AGE',999).column(5).item(1)

153294635

In [117]:
census_simplified = census.where('AGE',are.between(0,30)).select(0,1,4,7).relabeled(2,'2010').relabeled(3,'2013').where('SEX',are.above(0))
census_simplified

SEX  | AGE  | 2010    | 2013
1    | 0    | 2018420 | 2015537
1    | 1    | 2020332 | 2015352
1    | 2    | 2088685 | 2042522
1    | 3    | 2101272 | 2038085
1    | 4    | 2084312 | 2037953
1    | 5    | 2076573 | 2104725
1    | 6    | 2079410 | 2116922
1    | 7    | 2063139 | 2099841
1    | 8    | 2054462 | 2091869
1    | 9    | 2107037 | 2094425
... (50 rows omitted)

In [120]:
male2010 = sum(census_simplified.where('SEX',1).column(2))
female2010 = sum(census_simplified.where('SEX',2).column(2))

In [124]:
male2013 = sum(census_simplified.where('SEX',1).column(3))
female2013 = sum(census_simplified.where('SEX',2).column(3))

In [125]:
under_30 = Table().with_column('SEX',make_array(1,2)).with_column('2010', make_array(male2010,female2010)).with_column('2013', make_array(male2013,female2013))

In [127]:
under_30.with_column('Increase', under_30.column('2013')/under_30.column('2010'))

SEX  | 2010     | 2013     | Increase
1    | 64286842 | 64712772 | 1.00663
2    | 61747839 | 62035767 | 1.00466